const citiesData = {
  "أريانة-Aryana": {
    "ar": "أريانة",
    "en": "Aryana",
    "lat": 36.8587351,
    "lng": 10.188232,
    "cities": [
      {
        "ar": "أريانة المدينة",
        "en": "Ariana ville",
        "lat": 36.86906835,
        "lng": 10.184633840609944
      },
      {
        "ar": "حي التضامن",
        "en": "Cité Ettadhamen",
        "lat": 36.83244075,
        "lng": 10.113207216666666
      },
      {
        "ar": "رواد",
        "en": "Raoued",
        "lat": 36.959788,
        "lng": 10.205256809934195
      },
      {
        "ar": "سكرة",
        "en": "La Soukra",
        "lat": 36.8749751,
        "lng": 10.2454267
      },
      {
        "ar": "سيدي ثابت",
        "en": "Sidi Thabet",
        "lat": 36.9085108,
        "lng": 10.0425496
      },
      {
        "ar": "قلعة الأندلس",
        "en": "Kalaate Al Andalouss",
        "lat": 37.053151,
        "lng": 10.1222382
      },
      {
        "ar": "المنيهلة",
        "en": "Mnihla",
        "lat": 36.8533475,
        "lng": 10.1169734
      }
    ]
  },
  "باجة-Beja": {
    "ar": "باجة",
    "en": "Beja",
    "lat": 36.7236241,
    "lng": 9.1853919,
    "cities": [
      {
        "ar": "باجة الجنوبية",
        "en": "Béja Sud",
        "lat": 36.635975,
        "lng": 9.17596233815183
      },
      {
        "ar": "باجة الشمالية",
        "en": "Béja Nord",
        "lat": 36.804235000000006,
        "lng": 9.243137450068065
      },
      {
        "ar": "تبرسق",
        "en": "Téboursouk",
        "lat": 36.4615073,
        "lng": 9.2426211
      },
      {
        "ar": "تستور",
        "en": "Testour",
        "lat": 36.546575000000004,
        "lng": 9.459672958333329
      },
      {
        "ar": "تيبار",
        "en": "Thibar",
        "lat": 36.5237232,
        "lng": 9.106197465222252
      },
      {
        "ar": "عمدون",
        "en": "Amdoun",
        "lat": 36.78194,
        "lng": 9.088967722014925
      },
      {
        "ar": "قبلاط",
        "en": "Goubellat",
        "lat": 36.546355000000005,
        "lng": 9.685373086915295
      },
      {
        "ar": "مجاز الباب",
        "en": "Majaz Al Bab",
        "lat": 24.5873104,
        "lng": 46.7771866
      },
      {
        "ar": "نفزة",
        "en": "Nefza",
        "lat": 36.9748659,
        "lng": 9.0748388
      }
    ]
  },
  "بن عروس-Ben Arous": {
    "ar": "بن عروس",
    "en": "Ben Arous",
    "lat": 36.63064825,
    "lng": 10.210082703817534,
    "cities": [
      {
        "ar": "بن عروس المدينة",
        "en": "Ben Arous Ville",
        "lat": 36.7516855,
        "lng": 10.2245072
      },
      {
        "ar": "بومهل",
        "en": "Boumhel",
        "lat": 36.9210121,
        "lng": 10.1369342
      },
      {
        "ar": "حمام الأنف",
        "en": "Hammam Lif",
        "lat": 36.7313788,
        "lng": 10.3363985
      },
      {
        "ar": "حمام الشط",
        "en": "Hammam Chatt",
        "lat": 36.7136861,
        "lng": 10.3691813
      },
      {
        "ar": "رادس",
        "en": "Radès",
        "lat": 36.767891,
        "lng": 10.2724617
      },
      {
        "ar": "الزهراء",
        "en": "Ezzahra",
        "lat": 35.500172899999995,
        "lng": 11.01151078884433
      },
      {
        "ar": "فوشانة",
        "en": "Fouchana",
        "lat": 36.69471,
        "lng": 10.172476773648647
      },
      {
        "ar": "المحمدية",
        "en": "Mohammedia",
        "lat": 33.6958383,
        "lng": -7.3893292
      },
      {
        "ar": "المدينة الجديدة",
        "en": "Nouvelle Médina",
        "lat": 33.0648324,
        "lng": 10.260074795382021
      },
      {
        "ar": "مرناق",
        "en": "Mornag",
        "lat": 36.66721,
        "lng": 10.297943930493275
      },
      {
        "ar": "المروج",
        "en": "El Mourouj",
        "lat": 36.716605,
        "lng": 10.204891
      },
      {
        "ar": "مقرين",
        "en": "Megrine",
        "lat": 36.7703354,
        "lng": 10.2315885
      }
    ]
  },
  "بنزرت-Bizerte": {
    "ar": "بنزرت",
    "en": "Bizerte",
    "lat": 37.2720905,
    "lng": 9.8708565,
    "cities": [
      {
        "ar": "أوتيك",
        "en": "Utique",
        "lat": 37.058408650000004,
        "lng": 10.05451915637937
      },
      {
        "ar": "بنزرت الجنوبية",
        "en": "Bizerte Sud",
        "lat": 37.25738385,
        "lng": 9.667677641422609
      },
      {
        "ar": "بنزرت الشمالية",
        "en": "Bizerte Nord",
        "lat": 37.2720905,
        "lng": 9.8708565
      },
      {
        "ar": "تينجة",
        "en": "Tinja",
        "lat": 44.6905106,
        "lng": 18.5051362
      },
      {
        "ar": "جرزونة",
        "en": "Zarzouna",
        "lat": 37.2649034,
        "lng": 9.8854698
      },
      {
        "ar": "جومين",
        "en": "Joumine",
        "lat": 36.9253535,
        "lng": 9.3889921
      },
      {
        "ar": "رأس الجبل",
        "en": "Ras Jebel",
        "lat": 37.2146189,
        "lng": 10.1245603
      },
      {
        "ar": "سجنان",
        "en": "Sajnan",
        "lat": null,
        "lng": null
      },
      {
        "ar": "العالية",
        "en": "El Alia",
        "lat": 34.752187500000005,
        "lng": 10.721774221717387
      },
      {
        "ar": "غار الملح",
        "en": "Ghar El Melh",
        "lat": 37.167787149999995,
        "lng": 10.173134500697003
      },
      {
        "ar": "غزالة",
        "en": "Ghezala",
        "lat": 37.10721545,
        "lng": 9.584045878109201
      },
      {
        "ar": "ماطر",
        "en": "Mateur",
        "lat": 37.0385985,
        "lng": 9.6676974
      },
      {
        "ar": "منزل بورقيبة",
        "en": "Menzel Bourguiba",
        "lat": 37.1549472,
        "lng": 9.7925864
      },
      {
        "ar": "منزل جميل",
        "en": "Menzel Jemil",
        "lat": 37.239323,
        "lng": 9.9129702
      }
    ]
  },
  "قابس-Gabès": {
    "ar": "قابس",
    "en": "Gabès",
    "lat": 33.7765032,
    "lng": 9.793062965576159,
    "cities": [
      {
        "ar": "الحامة",
        "en": "El Hamma",
        "lat": 35.4716036,
        "lng": 7.085645632804178
      },
      {
        "ar": "غنوش",
        "en": "Ghannouch",
        "lat": 33.939816,
        "lng": 10.0650345
      },
      {
        "ar": "قابس الجنوبية",
        "en": "Gabès Sud",
        "lat": 33.77955,
        "lng": 10.052520319956145
      },
      {
        "ar": "قابس الغربية",
        "en": "Gabès Ouest",
        "lat": 33.87806,
        "lng": 9.998074123923473
      },
      {
        "ar": "قابس المدينة",
        "en": "Gabès Ville",
        "lat": 33.8878082,
        "lng": 10.10044
      },
      {
        "ar": "مارث",
        "en": "Mareth",
        "lat": 33.580484999999996,
        "lng": 10.266054220270266
      },
      {
        "ar": "مطماطة",
        "en": "Matmata",
        "lat": 34.0983766,
        "lng": -4.5508579
      },
      {
        "ar": "مطماطة الجديدة",
        "en": "Nouvelle Matmata",
        "lat": 33.654405,
        "lng": 9.980098212842458
      },
      {
        "ar": "المطوية",
        "en": "Métouia",
        "lat": 33.9589064,
        "lng": 10.0014342
      },
      {
        "ar": "منزل الحبيب",
        "en": "Menzel El Habib",
        "lat": 34.2310299,
        "lng": 9.670017167464803
      }
    ]
  },
  "قفصة-Gafsa": {
    "ar": "قفصة",
    "en": "Gafsa",
    "lat": 34.43367,
    "lng": 8.79079875204918,
    "cities": [
      {
        "ar": "أم العرائس",
        "en": "Moularès",
        "lat": 44.0708858,
        "lng": 2.293467
      },
      {
        "ar": "بالخير",
        "en": "Belkhir",
        "lat": 34.281625000000005,
        "lng": 9.460537149052477
      },
      {
        "ar": "الرديف",
        "en": "Redeyef",
        "lat": 34.3843201,
        "lng": 8.1538874
      },
      {
        "ar": "السند",
        "en": "Sind",
        "lat": 29.7616206,
        "lng": 76.2154197
      },
      {
        "ar": "سيدي عيش",
        "en": "Sidi Aich",
        "lat": 36.6127914,
        "lng": 4.6913091
      },
      {
        "ar": "القصر",
        "en": "El Ksar",
        "lat": 35.43473415,
        "lng": 10.993235587776242
      },
      {
        "ar": "القطار",
        "en": "El Guettar",
        "lat": 36.0879043,
        "lng": 0.8168474
      },
      {
        "ar": "قفصة الجنوبية",
        "en": "Gafsa Sud",
        "lat": 34.44377,
        "lng": 8.676698311962133
      },
      {
        "ar": "قفصة الشمالية",
        "en": "Gafsa Nord",
        "lat": 34.577085,
        "lng": 8.863276765029491
      },
      {
        "ar": "المتلوي",
        "en": "Métlaoui",
        "lat": 34.315723,
        "lng": 8.4018294
      },
      {
        "ar": "المظيلة",
        "en": "Mdhilla",
        "lat": 34.286879,
        "lng": 8.7480284
      }
    ]
  },
  "جندوبة-Jendouba": {
    "ar": "جندوبة",
    "en": "Jendouba",
    "lat": 36.4968705,
    "lng": 8.7763973,
    "cities": [
      {
        "ar": "بلطة بوعوان",
        "en": "Balta Bou Aouane",
        "lat": 36.69410805,
        "lng": 8.917714409067521
      },
      {
        "ar": "بوسالم",
        "en": "Bou Salem",
        "lat": 36.604858050000004,
        "lng": 8.953201491381995
      },
      {
        "ar": "جندوبة الجنوبية",
        "en": "Jendouba Sud",
        "lat": 36.4955356,
        "lng": 8.781498866541064
      },
      {
        "ar": "جندوبة الشمالية",
        "en": "Jendouba Nord",
        "lat": 36.53534895,
        "lng": 8.67094598267689
      },
      {
        "ar": "طبرقة",
        "en": "Tabarka",
        "lat": 36.9545614,
        "lng": 8.7573829
      },
      {
        "ar": "عين دراهم",
        "en": "Ain Draham",
        "lat": 36.77393155,
        "lng": 8.687259042551688
      },
      {
        "ar": "غار الدماء",
        "en": "Ghardimaou",
        "lat": 36.4465941,
        "lng": 8.4451502668508
      },
      {
        "ar": "فرنانة",
        "en": "Fernana",
        "lat": 36.6556629,
        "lng": 8.6957875
      },
      {
        "ar": "وادي مليز",
        "en": "Oued Meliz",
        "lat": 36.4678121,
        "lng": 8.5500007
      }
    ]
  },
  "القيروان-Kairouan": {
    "ar": "القيروان",
    "en": "Kairouan",
    "lat": 35.6710101,
    "lng": 10.10062,
    "cities": [
      {
        "ar": "بوحجلة",
        "en": "Bou Hajla",
        "lat": 35.38307375,
        "lng": 10.042194510081968
      },
      {
        "ar": "حاجب العيون",
        "en": "Hajeb El Ayoun",
        "lat": 35.395434,
        "lng": 9.5424162
      },
      {
        "ar": "حفوز",
        "en": "Haffuz",
        "lat": 35.6354138,
        "lng": 9.6717546
      },
      {
        "ar": "السبيخة",
        "en": "Sbikha",
        "lat": 35.95194965,
        "lng": 10.029667254795502
      },
      {
        "ar": "الشبيكة",
        "en": "Chebika Kairouan",
        "lat": 35.65887,
        "lng": 9.927648429245284
      },
      {
        "ar": "الشراردة",
        "en": "Echrarda",
        "lat": 35.09715,
        "lng": 10.027829853083851
      },
      {
        "ar": "العلا",
        "en": "El Alâa",
        "lat": 35.6292,
        "lng": 9.492372579531992
      },
      {
        "ar": "القيروان الجنوبية",
        "en": "Kairouan Sud",
        "lat": 35.57607555,
        "lng": 10.158929042378901
      },
      {
        "ar": "القيروان الشمالية",
        "en": "Kairouan Nord",
        "lat": 35.742808800000006,
        "lng": 10.092870035352774
      },
      {
        "ar": "نصر الله",
        "en": "Nasr Allah",
        "lat": 35.3528682,
        "lng": 9.8275341
      },
      {
        "ar": "الوسلاتية",
        "en": "Oueslatia",
        "lat": 35.8476563,
        "lng": 9.5932661
      }
    ]
  },
  "القصرين-Kasserine": {
    "ar": "القصرين",
    "en": "Kasserine",
    "lat": 35.1687646,
    "lng": 8.8365654,
    "cities": [
      {
        "ar": "تالة",
        "en": "Thala",
        "lat": 35.5717763,
        "lng": 8.6708968
      },
      {
        "ar": "حاسي الفريد",
        "en": "Hassi El Ferid",
        "lat": 34.941860000000005,
        "lng": 8.938297560126578
      },
      {
        "ar": "حيدرة",
        "en": "Haïdra",
        "lat": 35.809682,
        "lng": -5.3768338
      },
      {
        "ar": "جدليان",
        "en": "Jedelienne",
        "lat": 35.656625,
        "lng": 8.886257555711342
      },
      {
        "ar": "الزهور",
        "en": "Ezzouhour",
        "lat": 36.797425,
        "lng": 10.134098909090909
      },
      {
        "ar": "سبيبة",
        "en": "Sbiba",
        "lat": 35.544765,
        "lng": 9.045793063084112
      },
      {
        "ar": "سبيطلة",
        "en": "Sbeïtla",
        "lat": 35.2403383,
        "lng": 9.1203423
      },
      {
        "ar": "العيون",
        "en": "Ayoun",
        "lat": 33.2882365,
        "lng": 35.5839669
      },
      {
        "ar": "فريانة",
        "en": "Feriana",
        "lat": 34.960145,
        "lng": 8.586602746361255
      },
      {
        "ar": "فوسانة",
        "en": "Foussana",
        "lat": 35.35111,
        "lng": 8.62224101356383
      },
      {
        "ar": "القصرين الجنوبية",
        "en": "Kasserine Sud",
        "lat": 35.09787,
        "lng": 8.79065050898329
      },
      {
        "ar": "القصرين الشمالية",
        "en": "Kasserine Nord",
        "lat": 35.215785,
        "lng": 8.769887437138731
      },
      {
        "ar": "ماجل بلعباس",
        "en": "Majel Bel Abbès",
        "lat": 34.750428,
        "lng": 8.5231276
      }
    ]
  },
  "قبلي-Kébili": {
    "ar": "قبلي",
    "en": "Kébili",
    "lat": 33.7061148,
    "lng": 8.9698376,
    "cities": [
      {
        "ar": "سوق الأحد",
        "en": "Souk Lahad",
        "lat": 33.7783142,
        "lng": 8.8525855
      },
      {
        "ar": "دوز الشمالية",
        "en": "Douz Nord",
        "lat": 33.24610035,
        "lng": 9.551361029292298
      },
      {
        "ar": "دوز الجنوبية",
        "en": "Douz Sud",
        "lat": 33.069632549999994,
        "lng": 9.258407308246401
      },
      {
        "ar": "الفوار",
        "en": "El Faouar",
        "lat": 33.355963,
        "lng": 8.6732515
      },
      {
        "ar": "قبلي الشمالية",
        "en": "Kébili Nord",
        "lat": 33.72367695,
        "lng": 9.00645267478567
      },
      {
        "ar": "قبلي الجنوبية",
        "en": "Kébili Sud",
        "lat": 33.7068266,
        "lng": 9.021877637432501
      }
    ]
  },
  "الكاف-Kef": {
    "ar": "الكاف",
    "en": "Kef",
    "lat": 36.153639999999996,
    "lng": 8.608292440571825,
    "cities": [
      {
        "ar": "تاجروين",
        "en": "Tajerouine",
        "lat": 35.8913691,
        "lng": 8.5530477
      },
      {
        "ar": "الجريصة",
        "en": "Jérissa",
        "lat": 35.8450091,
        "lng": 8.6310155
      },
      {
        "ar": "الدهماني",
        "en": "Dahmani",
        "lat": 36.223919,
        "lng": 3.5869297
      },
      {
        "ar": "ساقية سيدي يوسف",
        "en": "Sakiet Sidi Youssef",
        "lat": 36.22083,
        "lng": 8.36796129400387
      },
      {
        "ar": "السرس",
        "en": "Le Sers",
        "lat": 36.0734659,
        "lng": 9.0192905
      },
      {
        "ar": "القصور",
        "en": "El Ksour",
        "lat": 35.226785,
        "lng": 9.99760620508982
      },
      {
        "ar": "القلعة الخصبة",
        "en": "Kalaat Khasba",
        "lat": 35.6654639,
        "lng": 8.5877785
      },
      {
        "ar": "قلعة سنان",
        "en": "Kalaat Senan",
        "lat": 35.7672773,
        "lng": 8.3438119
      },
      {
        "ar": "الكاف الشرقية",
        "en": "Kef Est",
        "lat": 36.184047899999996,
        "lng": 8.866570161875138
      },
      {
        "ar": "الكاف الغربية",
        "en": "Kef Ouest",
        "lat": 36.153639999999996,
        "lng": 8.608292440571825
      },
      {
        "ar": "نبر",
        "en": "Nebeur",
        "lat": 36.277829999999994,
        "lng": 8.758716151515154
      }
    ]
  },
  "المهدية-Mahdia": {
    "ar": "المهدية",
    "en": "Mahdia",
    "lat": 35.5042799,
    "lng": 11.06858500822606,
    "cities": [
      {
        "ar": "أولاد الشامخ",
        "en": "Ouled Chamekh",
        "lat": 35.4915017,
        "lng": 10.314841
      },
      {
        "ar": "بومرداس",
        "en": "Boumerdes",
        "lat": 36.7358032,
        "lng": 3.6163045700585252
      },
      {
        "ar": "الجم",
        "en": "El Jem",
        "lat": 35.2966435,
        "lng": 10.71284
      },
      {
        "ar": "السواسي",
        "en": "Essouassi",
        "lat": 35.329620000000006,
        "lng": 10.550795792553847
      },
      {
        "ar": "سيدي علوان",
        "en": "Sidi Alouane",
        "lat": 35.3750157,
        "lng": 10.9378385
      },
      {
        "ar": "الشابة",
        "en": "La Chebba",
        "lat": 35.2364059,
        "lng": 11.112972236411203
      },
      {
        "ar": "شربان",
        "en": "Chorbane",
        "lat": 35.26256,
        "lng": 10.408187176666667
      },
      {
        "ar": "قصور الساف",
        "en": "Ksour Essef",
        "lat": 35.4162835,
        "lng": 10.9987172
      },
      {
        "ar": "ملولش",
        "en": "Melloulech",
        "lat": 35.14241055,
        "lng": 11.007459686282665
      },
      {
        "ar": "المهدية المدينة",
        "en": "Mahdia Ville",
        "lat": 5.2820588,
        "lng": -59.1495337
      },
      {
        "ar": "هبيرة",
        "en": "Hebira",
        "lat": 35.196907350000004,
        "lng": 10.249121745025295
      }
    ]
  },
  "منوبة-Manouba": {
    "ar": "منوبة",
    "en": "Manouba",
    "lat": 36.8128294,
    "lng": 10.091944256580737,
    "cities": [
      {
        "ar": "برج العامري",
        "en": "Borj El Amri",
        "lat": 36.7302414,
        "lng": 9.885906702496667
      },
      {
        "ar": "البطان",
        "en": "El Batan",
        "lat": -0.17911860000000002,
        "lng": -78.47613435930202
      },
      {
        "ar": "الجديدة",
        "en": "Djedeida",
        "lat": 36.8492607,
        "lng": 9.9353189
      },
      {
        "ar": "دوار هيشر",
        "en": "Douar Hicher",
        "lat": 36.8216934,
        "lng": 10.097002861285203
      },
      {
        "ar": "طبربة",
        "en": "Tébourba",
        "lat": 36.822038649999996,
        "lng": 9.859015948862067
      },
      {
        "ar": "المرناقية",
        "en": "Mornaguia",
        "lat": 36.77111945,
        "lng": 10.012528271513972
      },
      {
        "ar": "منوبة المدينة",
        "en": "Manouba",
        "lat": 36.7624363,
        "lng": 9.833619078262766
      },
      {
        "ar": "وادي الليل",
        "en": "Oued Ellil",
        "lat": 36.83284795,
        "lng": 10.039089051307428
      }
    ]
  },
  "مدنين-Médenine": {
    "ar": "مدنين",
    "en": "Médenine",
    "lat": 33.3434014,
    "lng": 10.4910703,
    "cities": [
      {
        "ar": "بنقردان",
        "en": "Ben Gardane",
        "lat": 33.1403223,
        "lng": 11.2170109
      },
      {
        "ar": "بني خداش",
        "en": "Beni Khedache",
        "lat": 33.2513927,
        "lng": 10.2001033
      },
      {
        "ar": "جربة أجيم",
        "en": "Djerba Ajim",
        "lat": 33.7383472,
        "lng": 10.80147680082986
      },
      {
        "ar": "جربة ميدون",
        "en": "Midoun",
        "lat": 33.82481815,
        "lng": 11.007047341529542
      },
      {
        "ar": "جرجيس",
        "en": "Zarzis",
        "lat": 33.5036797,
        "lng": 11.1097173
      },
      {
        "ar": "جربة حومة السوق",
        "en": "Houmt Souk",
        "lat": 33.8759878,
        "lng": 10.8571532
      },
      {
        "ar": "سيدي مخلوف",
        "en": "Sidi Makhlouf",
        "lat": 34.06762805,
        "lng": 2.8669110685616186
      },
      {
        "ar": "مدنين الجنوبية",
        "en": "Médenine Sud",
        "lat": 33.3295218,
        "lng": 10.50032553125
      },
      {
        "ar": "مدنين الشمالية",
        "en": "Médenine Nord",
        "lat": 33.366466700000004,
        "lng": 10.48343299481402
      }
    ]
  },
  "المنستير-Monastir": {
    "ar": "المنستير",
    "en": "Monastir",
    "lat": 35.7707582,
    "lng": 10.8280511,
    "cities": [
      {
        "ar": "بنبلة",
        "en": "Bembla",
        "lat": 35.7027655,
        "lng": 10.776487821806187
      },
      {
        "ar": "بني حسان",
        "en": "Beni Hassen",
        "lat": 36.0281368,
        "lng": 1.7602185
      },
      {
        "ar": "البقالطة",
        "en": "Bekalta",
        "lat": 35.6172948,
        "lng": 10.9891336
      },
      {
        "ar": "جمال",
        "en": "Jemmel",
        "lat": 35.6239297,
        "lng": 10.7592359
      },
      {
        "ar": "زرمدين",
        "en": "Zéramdine",
        "lat": 35.5779404,
        "lng": 10.73323844059668
      },
      {
        "ar": "الساحلين",
        "en": "Sahline",
        "lat": 35.7512612,
        "lng": 10.7116486
      },
      {
        "ar": "صيادة",
        "en": "Sayada",
        "lat": 35.93340155,
        "lng": 0.13593002204345644
      },
      {
        "ar": "لمطة",
        "en": "Lamta",
        "lat": 35.66984205,
        "lng": 10.87890719728135
      },
      {
        "ar": "بوحجر",
        "en": "Bou hjar",
        "lat": 35.6694423,
        "lng": 10.861814071713088
      },
      {
        "ar": "طبلبة",
        "en": "Téboulba",
        "lat": 35.63109905,
        "lng": 11.005205336769592
      },
      {
        "ar": "قصر هلال",
        "en": "Ksar Hellal",
        "lat": 35.6516722,
        "lng": 10.906119548434997
      },
      {
        "ar": "قصيبة المديوني",
        "en": "Ksibet El Médiouni",
        "lat": 35.6852029,
        "lng": 10.839322636470797
      },
      {
        "ar": "المكنين",
        "en": "Moknine",
        "lat": 35.628257,
        "lng": 10.9001327
      },
      {
        "ar": "المنستير",
        "en": "Monastir",
        "lat": 39.38474,
        "lng": 9.044841
      },
      {
        "ar": "الوردانين",
        "en": "Ouardanine",
        "lat": 35.7097268,
        "lng": 10.67649
      }
    ]
  },
  "نابل-Nabeul": {
    "ar": "نابل",
    "en": "Nabeul",
    "lat": 36.4512897,
    "lng": 10.7355915,
    "cities": [
      {
        "ar": "بني خلاد",
        "en": "Béni Khalled",
        "lat": 36.6250666,
        "lng": 10.635279641116243
      },
      {
        "ar": "بني خيار",
        "en": "Beni Khiar",
        "lat": 36.50793645,
        "lng": 10.760805595170368
      },
      {
        "ar": "بوعرقوب",
        "en": "Bou Argoub",
        "lat": 36.5342202,
        "lng": 10.5498743
      },
      {
        "ar": "تاكلسة",
        "en": "Takilsa",
        "lat": null,
        "lng": null
      },
      {
        "ar": "حمام الأغزاز",
        "en": "Hammam Ghezèze",
        "lat": 36.933532299999996,
        "lng": 11.068121313886664
      },
      {
        "ar": "الحمامات",
        "en": "Hammamet",
        "lat": 36.4006557,
        "lng": 10.6190626
      },
      {
        "ar": "دار شعبان الفهري",
        "en": "Dar Chaabane Al Fehri",
        "lat": 36.4659592,
        "lng": 10.748106040334768
      },
      {
        "ar": "سليمان",
        "en": "Soliman",
        "lat": 36.720223000000004,
        "lng": 10.482011364122602
      },
      {
        "ar": "قربة",
        "en": "Korba",
        "lat": 22.3547468,
        "lng": 82.7110855
      },
      {
        "ar": "قرمبالية",
        "en": "Grombalia",
        "lat": 36.5984231,
        "lng": 10.4990402
      },
      {
        "ar": "قليبية",
        "en": "Kélibia",
        "lat": 36.8456561,
        "lng": 11.0935701
      },
      {
        "ar": "منزل بوزلفة",
        "en": "Menzel Bou Zelfa",
        "lat": 36.679962849999995,
        "lng": 10.58469356660588
      },
      {
        "ar": "منزل تميم",
        "en": "Menzel Temime",
        "lat": 36.7807127,
        "lng": 10.9939105
      },
      {
        "ar": "الميدة",
        "en": "El Mida",
        "lat": 36.73981275,
        "lng": 10.847787689194291
      },
      {
        "ar": "نابل",
        "en": "Nabeul",
        "lat": 36.4512897,
        "lng": 10.7355915
      },
      {
        "ar": "الهوارية",
        "en": "Al Haouaria",
        "lat": 37.0490588,
        "lng": 11.012816805661265
      }
    ]
  },
  "صفاقس-Sfax": {
    "ar": "صفاقس",
    "en": "Sfax",
    "lat": 34.723238699999996,
    "lng": 10.335847425638779,
    "cities": [
      {
        "ar": "بئر علي بن خليفة",
        "en": "Bir Ali Ben Khalifa",
        "lat": 34.7406664,
        "lng": 10.0958949
      },
      {
        "ar": "جبنيانة",
        "en": "Jebeniana",
        "lat": 35.0351623,
        "lng": 10.9089568
      },
      {
        "ar": "الحنشة",
        "en": "El Hencha",
        "lat": 35.1228878,
        "lng": 10.7415421
      },
      {
        "ar": "ساقية الدائر",
        "en": "Sakiet Eddaier",
        "lat": 34.79299925,
        "lng": 10.78562323145842
      },
      {
        "ar": "ساقية الزيت",
        "en": "Sakiet Ezzit",
        "lat": 34.805246350000004,
        "lng": 10.768686546696236
      },
      {
        "ar": "الصخيرة",
        "en": "Skhira",
        "lat": 35.463811,
        "lng": 8.8983864
      },
      {
        "ar": "صفاقس الجنوبية",
        "en": "Sfax Sud",
        "lat": 34.844083499999996,
        "lng": 10.651520407056953
      },
      {
        "ar": "صفاقس الغربية",
        "en": "Sfax Ouest",
        "lat": 34.7382869,
        "lng": 10.7187076
      },
      {
        "ar": "صفاقس المدينة",
        "en": "Sfax Ville",
        "lat": 34.73616905,
        "lng": 10.766235719131684
      },
      {
        "ar": "طينة",
        "en": "Thyna",
        "lat": 34.66921895,
        "lng": 10.710676624594058
      },
      {
        "ar": "العامرة",
        "en": "El Amra",
        "lat": 35.15322999999999,
        "lng": 9.650934270897835
      },
      {
        "ar": "عقارب",
        "en": "Agareb",
        "lat": 34.7267589,
        "lng": 10.544992907915717
      },
      {
        "ar": "قرقنة",
        "en": "Kerkennah",
        "lat": 34.643445549999996,
        "lng": 11.037579470468593
      },
      {
        "ar": "المحرس",
        "en": "Mahares",
        "lat": 34.5243588,
        "lng": 10.506321884794971
      },
      {
        "ar": "منزل شاكر",
        "en": "Menzel Chaker",
        "lat": 34.986653200000006,
        "lng": 10.304955447549276
      }
    ]
  },
  "سيدي بوزيد-Sidi Bouzid": {
    "ar": "سيدي بوزيد",
    "en": "Sidi Bouzid",
    "lat": 34.881181,
    "lng": 9.526359847182345,
    "cities": [
      {
        "ar": "أولاد حفوز",
        "en": "Ouled Haffouz",
        "lat": 35.083335,
        "lng": 9.845182011248593
      },
      {
        "ar": "بئر الحفي",
        "en": "Bir El Haffey",
        "lat": null,
        "lng": null
      },
      {
        "ar": "جلمة",
        "en": "Jilma",
        "lat": 41.3366911,
        "lng": 69.6540773
      },
      {
        "ar": "الرقاب",
        "en": "Regueb",
        "lat": 34.860405,
        "lng": 9.786632430091819
      },
      {
        "ar": "السبالة",
        "en": "Cebbala Ouled Asker",
        "lat": 35.228365,
        "lng": 9.312794079661419
      },
      {
        "ar": "السوق الجديد",
        "en": "Souk Jedid",
        "lat": 34.90697,
        "lng": 9.58030796691176
      },
      {
        "ar": "سيدي بوزيد الشرقية",
        "en": "Sidi Bouzid Est",
        "lat": 35.07233,
        "lng": 9.604522727272728
      },
      {
        "ar": "سيدي بوزيد الغربية",
        "en": "Sidi Bouzid Ouest",
        "lat": 35.03485235,
        "lng": 9.492805121192783
      },
      {
        "ar": "سيدي علي بن عون",
        "en": "Sidi Ali Ben Aoun",
        "lat": 34.88766775,
        "lng": 9.148242958224799
      },
      {
        "ar": "المزونة",
        "en": "Mezzouna",
        "lat": 34.550785000000005,
        "lng": 9.859630769472886
      },
      {
        "ar": "المكناسي",
        "en": "Meknassy",
        "lat": 34.6047708,
        "lng": 9.6022455
      },
      {
        "ar": "منزل بوزيان",
        "en": "Menzel Bouzaiane",
        "lat": 34.569630000000004,
        "lng": 9.417792389815556
      }
    ]
  },
  "سليانة-Slinah": {
    "ar": "سليانة",
    "en": "Slinah",
    "lat": 36.0846651,
    "lng": 9.3743733,
    "cities": [
      {
        "ar": "برقو",
        "en": "Bargou",
        "lat": 13.9394793,
        "lng": -2.9678861
      },
      {
        "ar": "بوعرادة",
        "en": "Bou Arada",
        "lat": 36.3510552,
        "lng": 9.6241481
      },
      {
        "ar": "الروحية",
        "en": "Rouhia",
        "lat": 35.651431,
        "lng": 9.0563411
      },
      {
        "ar": "سليانة الجنوبية",
        "en": "Siliana Sud",
        "lat": 36.0780039,
        "lng": 9.370267253931063
      },
      {
        "ar": "سليانة الشمالية",
        "en": "Siliana Nord",
        "lat": 36.0980535,
        "lng": 9.37513869931254
      },
      {
        "ar": "سيدي بورويس",
        "en": "Sidi Bou Rouis",
        "lat": 36.1770871,
        "lng": 9.1256499
      },
      {
        "ar": "العروسة",
        "en": "El Aroussa",
        "lat": 36.392671050000004,
        "lng": 9.447001126938819
      },
      {
        "ar": "قعفور",
        "en": "Gaâfour",
        "lat": 36.3242558,
        "lng": 9.3217604
      },
      {
        "ar": "الكريب",
        "en": "El Krib",
        "lat": 36.3270919,
        "lng": 9.1352778
      },
      {
        "ar": "كسرى",
        "en": "Kesra",
        "lat": 35.7965882,
        "lng": 9.366210522525325
      },
      {
        "ar": "مكثر",
        "en": "Makthar",
        "lat": 35.8558974,
        "lng": 9.2057475
      }
    ]
  },
  "سوسة-Sousse": {
    "ar": "سوسة",
    "en": "Sousse",
    "lat": 35.8288175,
    "lng": 10.6405392,
    "cities": [
      {
        "ar": "أكودة",
        "en": "Akouda",
        "lat": 35.8657303,
        "lng": 10.5678382
      },
      {
        "ar": "بوفيشة",
        "en": "Bouficha",
        "lat": 36.3084509,
        "lng": 10.447803858387772
      },
      {
        "ar": "حمام سوسة",
        "en": "Hammam Sousse",
        "lat": 35.8749788,
        "lng": 10.593518303712298
      },
      {
        "ar": "زاوية سوسة",
        "en": "Zaouiet Sousse",
        "lat": 35.78578495,
        "lng": 10.617340329264223
      },
      {
        "ar": "القصيبة",
        "en": "Ksibat Sousse",
        "lat": null,
        "lng": null
      },
      {
        "ar": "الثريات",
        "en": "Thrayett Sousse",
        "lat": null,
        "lng": null
      },
      {
        "ar": "سوسة جوهرة",
        "en": "Sousse Jawhara",
        "lat": 35.827863699999995,
        "lng": 10.612086587315485
      },
      {
        "ar": "حي الرياض",
        "en": "Cite Er-Riadh",
        "lat": 36.826011949999994,
        "lng": 10.073085823680746
      },
      {
        "ar": "حي الزهور",
        "en": "Ezzouhour Sousse",
        "lat": 35.79240405,
        "lng": 10.57473398493335
      },
      {
        "ar": "سيدي عبد الحميد",
        "en": "Sidi Abdelhamid",
        "lat": 35.796351900000005,
        "lng": 10.657520510031635
      },
      {
        "ar": "سوسة المدينة",
        "en": "Sousse",
        "lat": 35.8288175,
        "lng": 10.6405392
      }
    ]
  },
  "تطاوين-Tataouine": {
    "ar": "تطاوين",
    "en": "Tataouine",
    "city": "طقس تطاوين",
    "lat": 32.9315727,
    "lng": 10.450413,
    "cities": [
      {
        "ar": "بئر الأحمر",
        "en": "Bir Lahmar",
        "lat": 33.1785612,
        "lng": 10.4420751
      },
      {
        "ar": "تطاوين الجنوبية",
        "en": "Tataouine Sud",
        "lat": 32.7775261,
        "lng": 10.186138717298688
      },
      {
        "ar": "تطاوين الشمالية",
        "en": "Tataouine Nord",
        "lat": 32.7034273,
        "lng": 10.623193857153886
      },
      {
        "ar": "الذهيبة",
        "en": "Dehiba",
        "lat": 31.962912799999998,
        "lng": 10.466119844507851
      },
      {
        "ar": "رمادة",
        "en": "Remada",
        "lat": 32.3146481,
        "lng": 10.3987008
      },
      {
        "ar": "الصمار",
        "en": "Samar",
        "lat": 11.798221850000001,
        "lng": 125.16904177391692
      },
      {
        "ar": "غمراسن",
        "en": "Ghomrassen",
        "lat": 33.0615324,
        "lng": 10.347603758349422
      }
    ]
  },
  "توزر-Tozor": {
    "ar": "توزر",
    "en": "Tozor",
    "lat": 33.984410499999996,
    "lng": 8.07113085067842,
    "cities": [
      {
        "ar": "تمغزة",
        "en": "Tamerza",
        "lat": 34.3863938,
        "lng": 7.9334946
      },
      {
        "ar": "توزر",
        "en": "Tozeur",
        "lat": 33.984410499999996,
        "lng": 8.07113085067842
      },
      {
        "ar": "حزوة",
        "en": "Hazoua",
        "lat": 33.76421465,
        "lng": 7.6305186836868
      },
      {
        "ar": "دقاش",
        "en": "Dgueche",
        "lat": 33.990071900000004,
        "lng": 8.20369368483675
      },
      {
        "ar": "نفطة",
        "en": "Nefta",
        "lat": 33.8720687,
        "lng": 7.880684
      }
    ]
  },
  "تونس-Tunisie": {
    "ar": "تونس",
    "en": "Tunisie",
    "lat": 33.8439408,
    "lng": 9.400138,
    "cities": [
      {
        "ar": "باب البحر",
        "en": "Bab El Bhar",
        "lat": 36.79399239999999,
        "lng": 10.181120104227897
      },
      {
        "ar": "باب سويقة",
        "en": "Bab Souika",
        "lat": 36.806945,
        "lng": 10.168961927083334
      },
      {
        "ar": "باردو",
        "en": "Le Bardo",
        "lat": 4.7705643,
        "lng": -6.669232813103368
      },
      {
        "ar": "التحرير",
        "en": "Ettahrir",
        "lat": 36.824175,
        "lng": 10.12921506144578
      },
      {
        "ar": "جبل الجلود",
        "en": "Djebel Jelloud",
        "lat": 36.7708045,
        "lng": 10.1997843
      },
      {
        "ar": "الحرايرية",
        "en": "El-Hrairia",
        "lat": 36.789825,
        "lng": 10.122276613969373
      },
      {
        "ar": "حلق الوادي",
        "en": "La Goulette",
        "lat": 36.8159278,
        "lng": 10.3042378
      },
      {
        "ar": "حي الخضراء",
        "en": "Cité El Khadra",
        "lat": 36.832165,
        "lng": 10.192715968750003
      },
      {
        "ar": "الزهور",
        "en": "Ezzouhour Tunis",
        "lat": 36.797425,
        "lng": 10.134098909090909
      },
      {
        "ar": "السيجومي",
        "en": "Sijoumi",
        "lat": 36.7562927,
        "lng": 10.1739579190336
      },
      {
        "ar": "سيدي البشير",
        "en": "Sidi El Béchir",
        "lat": 36.788224150000005,
        "lng": 10.18268570309223
      },
      {
        "ar": "سيدي حسين",
        "en": "Sidi Hassine",
        "lat": 36.777899700000006,
        "lng": 10.116940189213175
      },
      {
        "ar": "العمران",
        "en": "El Omrane",
        "lat": 36.8149327,
        "lng": 10.167599870194127
      },
      {
        "ar": "العمران الأعلى",
        "en": "El Omrane supérieur",
        "lat": 36.84177,
        "lng": 10.1301258702752
      },
      {
        "ar": "قرطاج",
        "en": "Carthage",
        "lat": 32.1570412,
        "lng": -94.338114
      },
      {
        "ar": "الكبارية",
        "en": "Kabbaria",
        "lat": 36.7594142,
        "lng": 10.1908118
      },
      {
        "ar": "الكرم",
        "en": "Le Kram",
        "lat": 36.8348312,
        "lng": 10.3181518
      },
      {
        "ar": "المدينة",
        "en": "Médina de Tunis",
        "lat": 36.7986588,
        "lng": 10.1721131
      },
      {
        "ar": "المرسى",
        "en": "Marsa",
        "lat": 42.8225242,
        "lng": 2.1551881
      },
      {
        "ar": "المنزه",
        "en": "El Menzah",
        "lat": 36.8406161,
        "lng": 10.17580217946147
      },
      {
        "ar": "الوردية",
        "en": "El Ouardia",
        "lat": 36.765535,
        "lng": 10.177646995870491
      }
    ]
  },
  "زغوان-Zaghouan": {
    "ar": "زغوان",
    "en": "Zaghouan",
    "lat": 36.3994751,
    "lng": 10.1446349,
    "cities": [
      {
        "ar": "بئر مشارقة",
        "en": "Bir Mcherga",
        "lat": 36.5039417,
        "lng": 9.961727074296356
      },
      {
        "ar": "الزريبة",
        "en": "Zriba Village",
        "lat": 36.3406138,
        "lng": 10.2491768
      },
      {
        "ar": "زغوان",
        "en": "Zaghouan",
        "lat": 36.3319504,
        "lng": 10.045299971877625
      },
      {
        "ar": "صواف",
        "en": "Saouaf",
        "lat": 36.2275534,
        "lng": 10.1712341
      },
      {
        "ar": "الفحص",
        "en": "El Fahs",
        "lat": 36.3632487,
        "lng": 9.899836631278166
      },
      {
        "ar": "الناظور",
        "en": "Nador",
        "lat": 35.1749509,
        "lng": -2.937164648130004
      }
    ]
  }
};
